// beds.config.js
const db = require('./db'); 

module.exports = {
  zones: [
    {
      id: "female",
      title: "หอพักรวมผู้ป่วยหญิง",
      rooms: ["B21","B20","B13","B22","B19","B14","B23","B18","B15","B24","B17","B16"]
    },
    {
      id: "male",
      title: "หอพักรวมผู้ป่วยชาย",
      rooms: ["B04","B05","B12","B03","B06","B11","B02","B07","B10","B01","B08","B09"]
    },
    {
      id: "special",
      title: "ห้องพิเศษ",
      rooms: ["P01","P02","P01/1","P02/1"]
    },
    {
      id: "special1",
      title: "ห้องพิเศษ",
      rooms: ["P03","P04","P03/1","P04/1"]
    },
    {
      id: "special2",
      title: "ห้องพิเศษ",
      rooms: ["P05"]
    },
    {
      id: "isolation",
      title: "ห้องแยกโรค",
      rooms: ["D01"]
    },
     {
      id: "isolation2",
      title: "ห้องแยกโรค",
      rooms: ["D02"]
    },
    {
      id: "rehab",
      title: "ศูนย์ชีวาภิบาล",
      rooms: ["ชบ1","ชบ2","ชบ3","ชบ4"]
    },
    {
      id: "extra",
      title: "เตียงเสริม",
      type: "extra",            // 👈 สำคัญ (ไว้ใช้แยกสี)
      rooms: [
            "S01", "S04",
            "S02", "S05",
            "S03", "S06" ]
    }
  ]
};
